src/Documents/СписаниеКниг/СписаниеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеКниг</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <registerRecords>AccumulationRegister.ФондКниг</registerRecords>
  <tabularSections>
    <name>Экземпляры</name>
    <attributes>
      <name>Книга</name>
      <type><types>CatalogRef.Книги</types></type>
    </attributes>
    <attributes>
      <name>КодЭкземпляра</name>
      <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type><types>CatalogRef.МестаХранения</types></type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type><types>Number</types><numberQualifiers><precision>5</precision></numberQualifiers></type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type><types>String</types><stringQualifiers><length>200</length></stringQualifiers></type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ФондКниг/ФондКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФондКниг</name>
  <registerType>Balance</registerType>
  <dimensions>
    <name>Книга</name>
    <type><types>CatalogRef.Книги</types></type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type><types>CatalogRef.МестаХранения</types></type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type><types>String</types><stringQualifiers><length>50</length></stringQualifiers></type>
  </dimensions>
  <resources>
    <name>Количество</name>
    <type><types>Number</types><numberQualifiers><precision>10</precision></numberQualifiers></type>
  </resources>
</mdclass:AccumulationRegister>

src/Documents/СписаниеКниг/ObjectModule.bsl
// @strict-types

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ФондКниг.Записывать = Истина;

	Для Каждого Строка Из Экземпляры Цикл

		Движение = Движения.ФондКниг.Добавить();
		Движение.ВидДвижения   = ВидДвиженияНакопления.Расход;
		Движение.Период        = Дата;
		Движение.Книга         = Строка.Книга;
		Движение.МестоХранения = Строка.МестоХранения;
		Движение.Состояние     = "";
		Движение.Количество    = Строка.Количество;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Движения.ФондКниг.Записывать = Истина;

КонецПроцедуры

#КонецОбласти
